//
//  BookDetails.swift
//  SkroutzLibrary
//
//  Created by Yorwos Pallikaropoulos on 11/30/19.
//
/*
 {
     "book_details": {
         "series": "",
         "cover": "Μαλακό εξώφυλλο",
         "pubyear": 2017,
         "pages": 1008,
         "isbn": "9604617877",
         "shape": "21×14",
         "volume": "1/2",
         "ages": null,
         "description": "Ένα αγοράκι με κίτρινο αδιάβροχο τρέχει χαρούμενο δίπλα σ' ένα χάρτινο καραβάκι που αρμενίζει σ' ένα πλημμυρισμένο από τη βροχή ρείθρο. Η βροχή έχει κοπάσει πια, και πέφτει στην κίτρινη κουκούλα σαν ψιλόβροχο σε τσίγκινη στέγη. Το αγόρι με το κίτρινο αδιάβροχο είναι ο Τζορτζ Ντένμπροου, κι εκείνη τη φθινοπωρινή ημέρα ήταν έξι χρονών...\nΑυτό που κάνει τη μικρή πόλη του Ντέρι τόσο τρομακτικά διαφορετική από τις άλλες είναι όλα εκείνα που βλέπουν -και αισθάνονται- μόνο τα παιδιά. \nΣτα φρεάτια και τους υπονόμους, το Αυτό καραδοκεί και παίρνει τη μορφή εφιάλτη, του βαθύτερου τρόμου που φωλιάζει σε κάθε παιδί. Όμως, πότε πότε, το Αυτό προβάλλει από τα ζοφερά και υγρά βάθη, αρπάζει, διαμελίζει, σκοτώνει... \nΤα χρόνια περνούν, τα παιδιά μεγαλώνουν, εγκαταλείπουν την πόλη, λησμονούν. Μέχρι τη στιγμή που κάποιος τους καλεί να επιστρέψουν, για να αντιμετωπίσουν για μία ακόμα φορά το Αυτό, που σαλεύει σαν ερπετό στα σκοτεινά έγκατα της μνήμης τους καθώς αναδύεται  για να μετατρέψει τους εφιάλτες του παρελθόντος σε μια ανείπωτα φρικτή πραγματικότητα."
     }
 }
 */

import Foundation

public struct BookDetails:Decodable {
    public var series, cover: String?
    public var pubyear, pages: Int?
    public var isbn, shape, volume: String?
//    var ages: [Any]
    public var bookDetailsDescription: String?
}
